const codingQuestions = [
    {

        "Que": "C++ was developed by ?",

        "a": "Dennis Ritchie",

        "b": "Bjarne Stroustrup",
        "c": "James Gosling",

        "d": "Brian Kernighan",

        "Answer": "b"
    },

    {

        "Que": "Who is the founder of C language?",

        "a": "Dennis Ritchie",

        "b": "James Gosling",

        "c": "Brian Kernighan",

        "d": "Bjarne Stroustrup",

        "Answer": "a"
    },
    {

        "Que": "Which of the following cannot be a variable name in C?",

        "a": "volatile",

        "b": "true",

        "c": "friend",

        "d": "export",

        "Answer": "a"
    },
    {

        "Que": "Which keyword is used to prevent any changes in the variable within a C program?",

        "a": "immutable",

        "b": "mutable",

        "c": "const",

        "d": "volatile",

        "Answer": "c"
    },
    {

        "Que": "Java was developed by?",

        "a": "James Gosling",

        "b": "Brian Kernighan",

        "c": "Dennis Ritchie",

        "d": "None of these",

        "Answer": "a"
    },
    {

        "Que": "What is the only function all C++ programs must contain?",

        "a": "start()",

        "b": "system()",
        
        "c": "main()",

        "d": "program()",

        "Answer": "c"
    },

    {

        "Que": "Which of following is not accepted in C?",

        "a": "static a = 10;",

        "b": "static int func (int);",

        "c": "static static int a;",

        "d": "all of the mentioned",

        "Answer": "c"
    },
    {

        "Que": "Which of the following is a correct comment?",

        "a": "*/ Comments */",

        "b": "** Comment **",

        "c": "/* Comment */",

        "d": "{ Comment }",

        "Answer": "c"
    },
    {

        "Que": "Which of the following is the correct operator to compare two variables?",

        "a": ":=",

        "b": "equal",

        "c": "=",

        "d": "==",

        "Answer": "d"
    },
    {

        "Que": "Which of the following is not a correct variable type?",

        "a": "float",

        "b": "real",

        "c": "int",

        "d": "double",

        "Answer": "b"
    }


]

const cricketQuestions = [
    {

        "Que": "किस देश से क्रिकेट की शुरुआत हुई थी ?",

        "a": "ऑस्ट्रेलिया",

        "b": "भारत",
        "c": "इंग्लैंड",

        "d": "वेस्टइंडीज",

        "Answer": "c"
    },

    {

        "Que": "भारत ने दो विश्व कप जीते हैं, ये दोनों विश्व कप किस वर्ष में खेले गए थे??",

        "a": "1983 और 2011",

        "b": "1975 और 1979",

        "c": "1979 और 2011",

        "d": "1983 और 2007",

        "Answer": "a"
    },
    {

        "Que": " टेस्ट मुकाबले के पहले ही ओवर में हैट्रिक लेने वाले गेंदबाज कौन थे?",

        "a": "हरभजन सिंह (भारत)",

        "b": "इरफ़ान पठान (भारत)",

        "c": "वसीम अकरम (पाकिस्तान)",

        "d": "आलोक कपाली (बांग्लादेश)",

        "Answer": "b"
    },
    {

        "Que": " भारत में पहला टेस्ट मैच कहां खेला गया था?",

        "a": "मुंबई",

        "b": "पुणे",

        "c": "कोलकाता",

        "d": "चेन्नई",

        "Answer": "c"
    },
    {

        "Que": "टेस्ट क्रिकेट में सबसे तेज शतक लगाने का रिकॉर्ड किस खिलाड़ी के नाम है?",

        "a": "क्रिस गेल",

        "b": "ब्रेंडन मैकुलम",

        "c": "हार्दिक पंड्या",

        "d": "एडम गिलक्रिस्ट",

        "Answer": "b"
    },
    {

        "Que": "भारत की ओर से सर्वप्रथम टेस्ट टीम का नेतृत्व करने वाले खिलाड़ी कौन थे?",

        "a": "विजय हजारे",

        "b": "सी. के. नायडू",
        
        "c": "वीनू माकंड",

        "d": "रवि शास्त्री",

        "Answer": "b"
    },

    {

        "Que": "वानखेड़े स्टेडियम किस शहर में स्थित्त है?",

        "a": "पुणे",

        "b": "कोलकाता",

        "c": "मुंबई",

        "d": "चेन्नई",

        "Answer": "c"
    },
    {

        "Que": "कौन से देश ने पहला टी-20 विश्व कप जीता था?",

        "a": "पाकिस्तान",

        "b": "भारत",

        "c": "ऑस्ट्रेलिया",

        "d": "इंग्लैंड",

        "Answer": "b"
    },
    {

        "Que": "भारत की तरफ से सर्वप्रथम 500 विकेट लेने वाले खिलाड़ी कौन थे? ",

        "a": "कपिल देव",

        "b": "अजीत आगरकर",

        "c": "अनिल कुंबले",

        "d": "रविचंद्रन अश्विन",

        "Answer": "c"
    },
    {

        "Que": "भारत के पूर्व खिलाड़ी सचिन तेंदुलकर ने किस देश के खिलाफ अपना 100वां शतक लगाया था?",

        "a": "ऑस्ट्रेलिया",

        "b": "वेस्टइंडीज",

        "c": "बांग्लादेश",

        "d": "साउथ अफ्रीका",

        "Answer": "c"
    }


]

const historyQuestions = [
    {

        "Que": "हड़प्पा सभ्यता की खोज किसने की थी ?",

        "a": "दयाराम साहनी",

        "b": "राखलदास बनर्जी",
        "c": "एम. एम. वत्स",

        "d": "अन्य",

        "Answer": "a"
    },

    {

        "Que": "अंग्रेजों ने 'फूट डालो और शासन करो' की नीति कब अपनाई ?",

        "a": "1877 ई. में बाद",

        "b": "1833 ई. में बाद",

        "c": "1858 ई. में बाद",

        "d": "1857 ई. में बाद",

        "Answer": "c"
    },
    {

        "Que": "आर्य भारत में कहाँ से आए थे ?",

        "a": "पश्चिम एशिया से",

        "b": "पूर्व एशिया से",

        "c": "केन्द्रीय एशिया से",

        "d": "दक्षिण एशिया से",

        "Answer": "c"
    },
    {

        "Que": "गुप्त समाज की स्थापना किसने की थी ?",

        "a": "हर्षवर्धन",

        "b": " चन्द्रगुप्त",

        "c": "समुद्रगुप्त",

        "d": "ब्रह्यगुप्त",

        "Answer": "b"
    },
    {

        "Que": "पानीपत की दूसरी लड़ाई किनके बीच हुई थी?",

        "a": "वैग्म खान और हेमू",

        "b": "अकवर और मिर्जा हकीम",

        "c": "अकवर और वैग्म खान",

        "d": "अकवर और राणा प्रताप",

        "Answer": "a"
    },
    {

        "Que": "मुहम्मद गौरी कहाँ का शासक था ?",

        "a": "अफगानिस्तान",

        "b": "इराक",
        
        "c": "परशिया",

        "d": "तुर्की",

        "Answer": "a"
    },

    {

        "Que": "बिहार प्रदेश को किस मुस्लिम शासक ने सर्वप्रथम जीता था ?",

        "a": "वावर",

        "b": "खिलजी",

        "c": "तुगलक",

        "d": "चंगेज खान",

        "Answer": "b"
    },
    {

        "Que": "मुगलकाल में सर्वप्रथम किस शहर में अंग्रेजों ने अपने कारखाने स्थापित किए ?",

        "a": "मद्रास",

        "b": "कलकत्ता",

        "c": "मुंबई",

        "d": "सूरत",

        "Answer": "d"
    },
    {

        "Que": "किसके शासन काल में प्रथम चीनी यात्री भारत में आया था ?",

        "a": "समुद्रगुप्त",

        "b": "चन्द्रगुप्त प्रथम",

        "c": "हर्षवर्धन",

        "d": "चन्द्रगुप्त द्वितीय",

        "Answer": "d"
    },
    {

        "Que": "सिख समुदाय के अन्तिम गुरु थे ?",

        "a": "गुरु अर्जुन देव",

        "b": "गुरु तेग बहादुर",

        "c": "गुरु गोविन्द सिंघ",

        "d": "इनमें से कोई नहीं",

        "Answer": "c"
    }


]


